** Mode Line
#+begin_src emacs-lisp
  (use-package all-the-icons
    :ensure t)

  (use-package smart-mode-line
    :ensure t
    :config
    (setq sml/no-confirm-load-theme t)
    (sml/setup)
    (sml/apply-theme 'respectful)   ; respect the theme colors
    (setq sml/mode-width 'right
          sml/name-width 60)
    (setq-default mode-line-format
                  `("%e",
                    mode-line-front-space
                    mode-line-mule-info
                    mode-line-client
                    mode-line-modified
                    mode-line-remote
                    mode-line-frame-identification
                    mode-line-buffer-identification
                    sml/pos-id-separator
                    (vc-mode vc-mode)
                    " "
                  ;; mode-line-position
                    sml/pre-modes-separator
                    mode-line-modes
                    " "
                    mode-line-misc-info)))



  (defvar boon-command-state)
  (defvar boon-insert-state)
  (defvar boon-special-state)
  (defvar boon-off-state)

  (use-package doom-modeline
    :disabled
    :ensure t
    :hook (after-init-hook . doom-modeline-mode)
    :custom-face
    (mode-line ((t (:height 0.85))))
    (mode-line-inactive ((t (:height 0.85))))
    :custom
    (doom-modeline-height 15)
    (doom-modeline-bar-width 6)
    (doom-modeline-lsp t)
    (doom-modeline-github nil)
    (doom-modeline-mu4e nil)
    (doom-modeline-irc nil)
    (doom-modeline-minor-modes t)
    (doom-modeline-persp-name nil)
    (doom-modeline-buffer-file-name-style 'truncate-except-project)
    (doom-modeline-major-mode-color-icon t))

  (use-package mode-icons
    :ensure t
    :config
    (mode-icons-mode))

    (use-package powerline
      :ensure t
      :config
      (powerline-center-theme)
      :custom
      (powerline-default-separator 'curve)
      (powerline-gui-use-vcs-glyph t)
      (powerline-display-buffer-size nil)
      (powerline-display-hud nil)
      (powerline-display-mule-info nil)
      (powerline-default-separator-dir (quote (left . right))))
    ;;   (powerline-height 28)




    ;;   (powerline-inactive1 '((t (:background "grey11" :foreground "#c5c8c6"))))
    ;;   (powerline-inactive2 '((t (:background "grey20" :foreground "#c5c8c6")))))

    ;; (defun powerline-get-icon (name alt-sym help-message)
    ;;   "Returns a propertized icon if available, otherwise returns ALT-SYM."
    ;;   (propertize alt-sym 'help-echo help-message))

    ;; (defun powerline-modified ()
    ;;   (condition-case ex
    ;;       (let ((state (vc-git-state (buffer-file-name))))
    ;;         (cond ((buffer-modified -p)  (powerline-get-icon "pencil" "+" "Modified buffer"))
    ;;               ((eq state 'edited)    (powerline-get-icon "pencil" "+" "Modified buffer, unregistered changes"))
    ;;               ((eq state 'unregistered) (powerline-get-icon "question" "?" "Unregistered file in VCS"))
    ;;               ((eq state 'missing)   (powerline-get-icon "exclamation" "⁈" "File exists only in VCS, not on the hard disk"))
    ;;               ((eq state 'ignored)   (powerline-get-icon "ban" "⏶" "ignored file in VCS"))
    ;;               ((eq state 'added)     (powerline-get-icon "plus" "＋" "File will be registered in VCS in the next commit"))
    ;;               (t " ")))
    ;;     (error (powerline-get-icon "exclamation" "⁈" (car ex)))))

    ;; (defun is-mode-p (mode)
    ;;   "Predicate to return `true' if the current buffer's major mode matches the requested MODE."
    ;;   (buffer-local-value 'major-mode (current-buffer))
    ;;   (eq major-mode model))

    ;; (defun current-ruby-mode-line ()
    ;;   "Display the Ruby version and Gemset (using RVM) if `ruby-mode' is enabled. Nil otherwise."
    ;;   (ignore-errors
    ;;     (when (is-mode-p 'ruby-mode)
    ;;       (concat (replace-regexp-in-string "ruby-" "" ruby--current-ruby)
    ;;               (when rvm--current-gemset
    ;;                 " 💎 ") rvm--current-gemset))))

    ;; (defun current-ruby-mode-line ()
    ;;   "Display the Ruby version and Gemset (using RVM) if `ruby-mode' is enabled. Nil otherwise."
    ;;   (ignore-errors
    ;;     (when (is-mode-p 'ruby-mode)
    ;;       (concat (replace-regexp-in-string "ruby-" "" rvm--current-ruby)
    ;;               (propertize " \xe92b " ; "\xe92a"
    ;;                           'face `(:family "all-the-icons" :height 1.2)
    ;;                           'display '(raise -0.1))
    ;;               (when rvm--current-gemset
    ;;                 rvm--current-gemset)))))

    ;; ;; Display the current Python virtual environment using `pyenv':
    ;; (defun current-python-mode-line ()
    ;;   "Display the Python virtual environmwnt and verison if `python-mode' is enabled. Nil otherwise."
    ;;   (ignore-errors
    ;;     (when (and (is-mode-p 'python-mode) (pyenv-mode-version))
    ;;       (convat "🐍" (pyenv-mode-version)))))

    ;; (defun current-python-mode-line ()
    ;;   "Display the Python virtual environmwnt and verison if `python-mode' is enabled. Nil otherwise."
    ;;   (ignore-errors
    ;;     (when (and (is-mode-p 'python-mode) (pyenv-mode-version))
    ;;       (concat
    ;;        (propertize "\xe928 "
    ;;                    'face `(:family "all-the-icons")
    ;;                    'display '(raise -0.1))
    ;;        (pyenv-mode-version)))))

    ;; ;; PUt everthing together, where we will either display the Ruby, Python, or if no particular language, display the eyebrowse:
    ;; (defun powerline-lang-version ()
    ;;   "docstring"
    ;;   (or (current-python-mode-line)
    ;;       (current-ruby-mode-line)
    ;;       (when (derived-mode-p 'prog-mode)
    ;;         which-func-format)
    ;;       " "))

    ;; (defun powerline-project-vc ()
    ;;   (ignore-errors
    ;;     (when (projectile-project-p)
    ;;       (propertize (projectile-project-name)
    ;;                   'help-echo (format "Base: %s"
    ;;                                      (projectile-project-root))))))
    ;; ;; Mode line format
    ;; ;; Let's put everything together into our mode-line:

    ;; (setq-default mode-line-format
    ;;               '("%e"
    ;;                 (:eval
    ;;                  (let* ((active (powerline-selected-window-active))
    ;;                         (mode-line-buffer-id (if active 'mode-line-buffer-id 'mode-line-buffer-id-inactive))
    ;;                         (mode-line (if active 'mode-line 'mode-line-inactive))
    ;;                         (face1 (if active 'powerline-active1 'powerline-inactive1))
    ;;                         (face2 (if active 'powerline-active2 'powerline-inactive2))
    ;;                         (separator-left (intern (format "powerline-%s-%s"
    ;;                                                         (powerline-current-separator)
    ;;                                                         (car powerline-default-separator-dir))))
    ;;                         (separator-right (intern (format "powerline-%s-%s"
    ;;                                                          (powerline-current-separator)
    ;;                                                          (cdr powerline-default-separator-dir))))
    ;;                         (lhs (list
    ;;                               ;; Section 1: File status and whatnot
    ;;                               (powerline-raw (powerline-modified) face1 'l)
    ;;                               (powerline-raw-mode-line-client face1 'l)
    ;;                               (powerline-raw " " face 'l)

    ;;                               ;;Section 2: ( Buffer Name ) ... bright
    ;;                               (funcall separator-right face1 mode-line)
    ;;                               (powerline-buffer-id mode-line-buffer-id 'l)
    ;;                               (powerline-raw " " mode-line)
    ;;                               (funcall separator-left mode-line face1)

    ;;                               ;; Section 3: Git ... dark
    ;;                               (powerline-narrow face1 'l)
    ;;                               (powerline-raw " " face1)
    ;;                               (powerline-raw (powerline-project-vc) face1 'l)
    ;;                               (powerline-vc face1 'l)))

    ;;                         (rhs (list (powerline-raw global-mode-string face1 'r)
    ;;                                    ;; Section 1: Language-specific .. optional
    ;;                                    (powerline-raw (powerline-lang-version) face1 'r)))

    ;;                         (center (list (powerline-raw " " face1)
    ;;                                       (funcall separator-left face1 face2)
    ;;                                       (when (and (boundp 'erc-track-minor-mode) erc-track-minor-mode)
    ;;                                         (powerline-raw erc-modified-channels-object face2 'l))
    ;;                                       (powerline-major-mode face2 'l)
    ;;                                       (powerline-process face2)
    ;;                                       (powerline-raw " :" face2)
    ;;                                       (powerline-minor-modes face2 'l)
    ;;                                       (powerline-raw " " face2)
    ;;                                       (funcall separator-right face2 face1))))
    ;;                    (concat (powerline-render lhs)
    ;;                            (powerline-fill-center face1 (/ (powerline-width center) 2.0))
    ;;                            (powerline-render center)
    ;;                            (powerline-fill face1 (powerline-width rhs))
    ;;                            (powerline-render rhs))))))


    ;; (message "Modeline Completed")
#+end_src

#+RESULTS:
: Modeline Completed

